package ru.spsuace.projects.clothing.factory;

/**
 * Смольский Валерий
 *
 * Создать систему, имитирующую фабрику одежды
 * 1) фабрика должна изготавливать одежду (различную) и ткани (только хлопоковые)
 * 2) процессы должны максимально переиспользоваться (например делаем ткань, а потом футболку)
 * 3) Вся продукуия поставляется на склад
 * 4) Если нам чего-то не хватает на складе (например джинсовой ткани для джинс, мы делаем заказ)
 * 5) Задана скорость производства (килограмм одежды в час, в зависимости от типа продукции)
 * 6) Если мы можем что-то произвести, то мы это не покупаем
 * 7) Задано максимальное количество линий производства (на каждой линии может производиться только что то одно,
 * например звсего 5 линий, на одной делаем джинсы из джинсовой ткани, на второй делаем кофты из клопка и
 * 3 линии делают хлопковую ткань)
 * 8) В любой момент мы должны выдать какое количество и чего есть на складе
 * 9) цепочку производства - придумайте сами. Минимум 3 элемента в цепочке должно быть
 */
public class ClothingFactory {

}
