package ru.spsuace.projects.clothing.accouting;

/**
 * Создать систему, имитирующую складскую деятельность
 * 1) Есть склад в котором лежат различные товары в различном количестве
 * 2) Есть поставщик товаров, n единиц в час (где n зависит от товара)
 * 3) Если клиенты, которые хотят купить заданный товар
 * 4) Если заданного товара на складе нет, то идет заказ поставщику
 * 5) Как только количество товара набралось на заявку клиента, он отгружается ему
 * 6) Количество поставщиков ограничено
 * 7) Какой клиент первый заказал, такой и должен первый получить товар
 * 8) Время увеличивается с помощью специального метода
 */
public class AccoutingSystem {

}
