package ru.spsuace.projects.restaurant;

/**
 * Поддубнова Дарья
 *
 * Создать систему, имитирующую Ресторан
 * 1) В ресторане есть небольшое меню с набором блюд
 * 2) Блюда состоят из определаеных индигриентов + цена и время готовки
 * 3) В ресторане заданное количество посадочных мест
 * 4) Время обеда равняется n * время готовки
 * 5) Количество продуктов на складе определенно, в случае нехватки продуктов делается заказ на определенное количество
 * Время доставки для разных продуктов разное
 * 6) Время в системе меняется специальным методом (добавляем к текущему времени пол часа)
 * 7) Если все занято, новые гости не могут зайти в ресторан.
 * 8) Гостям нужно время на выбор продуктов
 * 9) В любой момент времени можно узнать текущий баланс ресторана, количество гостей по типам (ждут еду, выбирают, кушают)
 */
public class Restaurant {
}
