package ru.spsuace.projects.hotels;

/**
 * Создать систему, имитирующую отель.
 * 1) Отель имеет размер, текущую сумму на счету и бронирования на год
 * 2) Номера бывают на одного, двух, трех человек. Номера на одного и двух человек общие, но разная цена.
 * 3) Так же есть номера блочного типа (три номера по 2 человка с одним туалетом и ванной на блок)
 * 4) Клиенты пытаются забронировать номера на заданные даты и нужное количество-человек.
 * Отель предоставляет несолько вариантов, клиент выбирает только один
 * 5) Завтрак в бронь может быть включен или нет.
 * 6) Каждый номер имеет свою себестоимость (зависит от размера, типа и завтрака)
 * 7) Отель должен уметь считать потенциальную выручку на конец года
 */
public class Hotel {

}
