package ru.spsuace.projects.car;

/**
 * Создать систему, имитирующую завод по изготвлению автомобилей
 * 1) Завод производит разные типы автомобилей (грузовики, микроавтобусы и тд)
 * 2) Завод может производить авто полностью сам, а может собирать из комплектующих
 * 3) Машина состоит из нескольких основных комплектующих (выберите штук 5 на свое усмотрение)
 * 4) Завод получает материалы с других заводов
 * 5) На каждую машину нужны определенное количество различных материалов
 * 6) Клиенты могут заказывать машины пачками (не более 10 за раз) или по одной штуке
 * (этот функционал можно сделать миллионом способов, самый сложный - использовать блокирующие очереди,
 * вы можете использовать любой)
 * 7) Машины делаются по мере поступления заказов
 */
public class CarFactory {
}
