package ru.spsuace.projects.investment;

/**
 * Нужно имулировать работу инвестиционного портфеля
 * 1) Есть рынок акций, акции могут менять свою цену
 * 2) Есть портфель на который можно вводить и выводить средства
 * 3) Можно покупать акции в портфель по заданной цене
 * 4) Можно ставить стоп-лоссы и тэйк-профиты, которые будут автомотически покупать/продавать нужное количество акций,
 * если цена достигла некоторого значения
 * 5) По некоторым акциям иногда платятся диведенды
 * 6) За каждую сделку списывается заданная комиссия
 * 7) Портфель всегда должен отображать текущую стоимость
 * 8) Так же он должен а процентом соотношении показывать сколько мы заработали/потеряли
 */
public class Portfolio {
}
